---
title: TriangulatedShellComponent
classe: Autodesk.Revit.DB.TriangulatedShellComponent
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# TriangulatedShellComponent

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsClosed { get; }` | `triangulatedShellComponent.IsClosed` | Boolean |
| `Boolean IsValidObject { get; }` | `triangulatedShellComponent.IsValidObject` | Boolean |
| `Int32 TriangleCount { get; }` | `triangulatedShellComponent.TriangleCount` | Int32 |
| `Int32 VertexCount { get; }` | `triangulatedShellComponent.VertexCount` | Int32 |
| `Void Clear()` | `triangulatedShellComponent.Clear()` | Void |
| `Void Dispose()` | `triangulatedShellComponent.Dispose()` | Void |
| `TriangleInShellComponent GetTriangle(Int32)` | `triangulatedShellComponent.GetTriangle(triangleIndex)` | TriangleInShellComponent |
| `XYZ GetVertex(Int32)` | `triangulatedShellComponent.GetVertex(vertexIndex)` | XYZ |
| `IList<XYZ> GetVertices()` | `triangulatedShellComponent.GetVertices()` | IList<XYZ> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```